chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D41.xml
        <register>
          <name>DRIVER1</name>
          <description>I/O Drive Register 1</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xAAAAAAAA</resetValue>
          <fields>
            <field>
              <name>LINE0</name>
              <description>Drive of PIO Line 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE1</name>
              <description>Drive of PIO Line 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE2</name>
              <description>Drive of PIO Line 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE3</name>
              <description>Drive of PIO Line 3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE4</name>
              <description>Drive of PIO Line 4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE5</name>
              <description>Drive of PIO Line 5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE6</name>
              <description>Drive of PIO Line 6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE7</name>
              <description>Drive of PIO Line 7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE8</name>
              <description>Drive of PIO Line 8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE9</name>
              <description>Drive of PIO Line 9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE10</name>
              <description>Drive of PIO Line 10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE11</name>
              <description>Drive of PIO Line 11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE12</name>
              <description>Drive of PIO Line 12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE13</name>
              <description>Drive of PIO Line 13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE14</name>
              <description>Drive of PIO Line 14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINE15</name>
              <description>Drive of PIO Line 15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LO_DRIVE</name>
                  <description>Low drive</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ME_DRIVE</name>
                  <description>Medium drive</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HI_DRIVE</name>
                  <description>High drive</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
